camel-soap-proxy/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:reverse xmlns:ns2="urn:switchyard-quickstart:camel-soap-proxy:1.0">
            <text>foobar</text>
        </ns2:reverse>
    </S:Body>
</S:Envelope>
